In [4]:
# -*- coding: utf-8 --*-

import pandas as pd
dict_data= {'a':1,'b':2,'c':3}
sr = pd.Series(dict_data)

print(sr)
print(type(sr))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
import pandas as pd
import seaborn as sns
import numpy as np

In [6]:
df = sns.load_dataset("iris")
df.shape

(150, 5)

In [7]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

value_counts() 시리즈 객체의 고유값 개수를 세는데 사용

In [8]:
df['species'].value_counts() #범주형 데이터

virginica     50
versicolor    50
setosa        50
Name: species, dtype: int64

In [9]:
df['petal_width'].value_counts() #숫자형 데이터

0.2    29
1.3    13
1.5    12
1.8    12
1.4     8
2.3     8
1.0     7
0.3     7
0.4     7
2.0     6
2.1     6
0.1     5
1.2     5
1.9     5
1.6     4
2.5     3
2.2     3
2.4     3
1.1     3
1.7     2
0.6     1
0.5     1
Name: petal_width, dtype: int64

In [10]:
pd.DataFrame(df['petal_width'].value_counts())

     petal_width
0.2           29
1.3           13
1.5           12
1.8           12
1.4            8
2.3            8
1.0            7
0.3            7
0.4            7
2.0            6
2.1            6
0.1            5
1.2            5
1.9            5
1.6            4
2.5            3
2.2            3
2.4            3
1.1            3
1.7            2
0.6            1
0.5            1

In [11]:
len(df)

150

In [12]:
df.shape[0]
#[0] 또는 [1] 을 하는데 0은 행 1은 열

150

In [13]:
df.shape[1]

5

In [14]:
len(df) == df.shape[0]

True

In [15]:
df['species'].nunique() #명확한 유일한값의 개수 확인

3

In [16]:
df.describe(include='all') #요약 통계량을 보여줌 include='all' 모든걸

        sepal_length  sepal_width  petal_length  petal_width    species
count     150.000000   150.000000    150.000000   150.000000        150
unique           NaN          NaN           NaN          NaN          3
top              NaN          NaN           NaN          NaN  virginica
freq             NaN          NaN           NaN          NaN         50
mean        5.843333     3.057333      3.758000     1.199333        NaN
std         0.828066     0.435866      1.765298     0.762238        NaN
min         4.300000     2.000000      1.000000     0.100000        NaN
25%         5.100000     2.800000      1.600000     0.300000        NaN
50%         5.800000     3.000000      4.350000     1.300000        NaN
75%         6.400000     3.300000      5.100000     1.800000        NaN
max         7.900000     4.400000      6.900000     2.500000        NaN

In [17]:
df.describe(include=[np.object]) #object type 만 보여줌

          species
count         150
unique          3
top     virginica
freq           50

In [18]:
df.describe(include=[np.number]) #숫자형 타입만 보여짐

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [19]:
df['petal_width'].sum()

179.90000000000003

In [20]:
df['petal_width'].count()

150

In [23]:
df['petal_width'].median()

1.3

In [24]:
df.median()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [25]:
df['petal_width'].mean()

1.199333333333334

In [26]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [27]:
pd.DataFrame(df.mean())

                     0
sepal_length  5.843333
sepal_width   3.057333
petal_length  3.758000
petal_width   1.199333

In [28]:
df['petal_width'].quantile([0.25, 0.75])

0.25    0.3
0.75    1.8
Name: petal_width, dtype: float64

In [29]:
df.min()

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [31]:
df.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object

In [32]:
df.var()

sepal_length    0.685694
sepal_width     0.189979
petal_length    3.116278
petal_width     0.581006
dtype: float64

In [33]:
df.std()

sepal_length    0.828066
sepal_width     0.435866
petal_length    1.765298
petal_width     0.762238
dtype: float64

In [34]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

apply

결측치 다루기 dropna(), fillna(), isnull(), notnull()

In [35]:
import pandas as pd
import numpy as np

In [36]:
df.dropna?

In [40]:
df = pd.DataFrame ([[np.nan, 2 ,np.nan, 0],
                     [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5]],
                   columns=list("ABCD"))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [42]:
df.dropna(axis=0, how='all') #axis=0 god how='all' 전부다 널값이면 드롭

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [44]:
df.dropna(axis=1,how='all')
#c열만 다 널값이니 드롭

     A    B  D
0  NaN  2.0  0
1  3.0  4.0  1
2  NaN  NaN  5

In [46]:
df.dropna(axis=1,how='any') #널값 이 있으면 드롭 how='any'

   D
0  0
1  1
2  5

In [47]:
df.fillna(0) #null값을 0으로 채움

     A    B    C  D
0  0.0  2.0  0.0  0
1  3.0  4.0  0.0  1
2  0.0  0.0  0.0  5

In [48]:
values={"A":0, "B":1, "C":2, "D":3}
df.fillna(value=values)

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5

In [49]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

평균값으로 채우기

In [50]:
df["A"].mean()

3.0

In [52]:
df["D"].median()

1.0

In [53]:
df.fillna(df["D"].median())

     A    B    C  D
0  1.0  2.0  1.0  0
1  3.0  4.0  1.0  1
2  1.0  1.0  1.0  5

In [54]:
fill_na_value = df["D"].max()
fill_na_value

5

In [55]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False

In [56]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5

In [58]:
df.isnull().sum() #결측치가 몇 개인지 확인.

A    2
B    1
C    3
D    0
dtype: int64

In [60]:
df.notnull().sum() # 결측치가 아닌것 개수확인

A    1
B    2
C    0
D    3
dtype: int64

assign() 새로운 컬럼을 데이터프레임에 배정(Assign)하는 함수.

In [61]:
import pandas as pd
import numpy as np

In [63]:
df = pd.DataFrame({"A":range(1,11), "B":np.random.randn(10)})
df

    A         B
0   1 -0.413088
1   2  0.201642
2   3 -1.280713
3   4  0.520524
4   5 -1.350623
5   6  0.022474
6   7 -0.432605
7   8 -0.296691
8   9  0.597176
9  10 -0.635970

In [65]:
df.assign?
#Assign new columns to a DataFrame.

In [67]:
df.assign(In_A = lambda x: np.log(x.A))

    A         B      In_A
0   1 -0.413088  0.000000
1   2  0.201642  0.693147
2   3 -1.280713  1.098612
3   4  0.520524  1.386294
4   5 -1.350623  1.609438
5   6  0.022474  1.791759
6   7 -0.432605  1.945910
7   8 -0.296691  2.079442
8   9  0.597176  2.197225
9  10 -0.635970  2.302585

In [68]:
df.assign(In_A = lambda x: np.log(x.A)).head()

   A         B      In_A
0  1 -0.413088  0.000000
1  2  0.201642  0.693147
2  3 -1.280713  1.098612
3  4  0.520524  1.386294
4  5 -1.350623  1.609438

In [69]:
df["In_A"] = np.log(df.A)

In [70]:
df

    A         B      In_A
0   1 -0.413088  0.000000
1   2  0.201642  0.693147
2   3 -1.280713  1.098612
3   4  0.520524  1.386294
4   5 -1.350623  1.609438
5   6  0.022474  1.791759
6   7 -0.432605  1.945910
7   8 -0.296691  2.079442
8   9  0.597176  2.197225
9  10 -0.635970  2.302585

Qcut으로 범주화 하기

bin column 을 n개의 bucket으로 변화시킴
숫자형 데이터를 n개의 범주로 구분할때 사용함

max(axis=1)/min(axis =1)

clip() 임계치 값을 지정해서 값을 변화시켜줄 때 사용
abs() 절대값.

In [73]:
pd.qcut?

In [72]:
pd.qcut(df.A, 3, labels=["good", "median", "bad"])

0      good
1      good
2      good
3      good
4    median
5    median
6    median
7       bad
8       bad
9       bad
Name: A, dtype: category
Categories (3, object): ['good' < 'median' < 'bad']

In [75]:
pd.qcut(df.B, 2, labels=["bad", "good"])

0     bad
1    good
2     bad
3    good
4     bad
5    good
6     bad
7    good
8    good
9     bad
Name: B, dtype: category
Categories (2, object): ['bad' < 'good']

In [76]:
df.max(axis=0) # 행에서 최대값 가져오기

A       10.000000
B        0.597176
In_A     2.302585
dtype: float64

In [78]:
df["A"]

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: A, dtype: int64

In [77]:
df["A"].clip(lower = -10, upper=10)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: A, dtype: int64

In [79]:
df["B"]

0   -0.413088
1    0.201642
2   -1.280713
3    0.520524
4   -1.350623
5    0.022474
6   -0.432605
7   -0.296691
8    0.597176
9   -0.635970
Name: B, dtype: float64

In [80]:
df["B"].abs() #절대값으로 변환

0    0.413088
1    0.201642
2    1.280713
3    0.520524
4    1.350623
5    0.022474
6    0.432605
7    0.296691
8    0.597176
9    0.635970
Name: B, dtype: float64